app/views/quests/new.html.erb

            <div class="ml-5">
            <%= f.select :start_pref, options_for_select(Prefecture.all.map{ |pref| [pref.name] }) %>
            <%= f.select :start_city, options_for_select(City.all.map{ |city| [city.name] }) %>
---
SELECT "prefectures".* FROM "prefectures"
SELECT "cities".* FROM "cities"