app/views/notifications/index.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
          <p class="small text-muted">
            <%= Comment.find_by(id: notif.comment_id)&.comment.truncate(25) %></p>