app/views/users/mypage.html.erb

              <%= link_to board.title.truncate(20), board_path(board), class:"text-dark" %>
              <span>(<%= board.comments.count %>)</span><br/>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."board_id" = ?  [["board_id", 1]]