app/views/boards/index.html.erb

              <td><%= board.body.truncate(50) %></td>
              <td><%= board.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."board_id" = ?  [["board_id", 1]]