app/controllers/boards_controller.rb

  def index
    @board = Board.new
    if params[:word].present?
      @boards = Board.where('title LIKE ? OR body LIKE ?', "%#{params[:word]}%",
                            "%#{params[:word]}%").order(created_at: 'DESC').page(params[:page])
      @word = params[:word]
    else
      @boards = Board.all.order(created_at: 'DESC').page(params[:page]).per(20)
---
SELECT  "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    @board = Board.new(board_params)
    @boards = Board.all.order(created_at: 'DESC').page(params[:page]).per(20)
    if @board.save
---
INSERT INTO "boards" ("title", "created_at", "updated_at", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "引越しについて"], ["created_at", "2022-03-18 08:20:34.491089"], ["updated_at", "2022-03-18 08:20:34.491089"], ["body", "mx-auto"], ["user_id", 1]]

  def show
    @board = Board.find(params[:id])
    @comment = Comment.new
    if params[:word].present?
      @comments = Comment.where('comment LIKE ?', "%#{params[:word]}%").page(params[:page])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."board_id" = ? LIMIT ? OFFSET ?  [["board_id", 1], ["LIMIT", 25], ["OFFSET", 0]]