app/controllers/comments_controller.rb

INSERT INTO "comments" ("board_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["board_id", 1], ["user_id", 1], ["comment", "っg\r\n"], ["created_at", "2022-03-18 08:20:40.957408"], ["updated_at", "2022-03-18 08:20:40.957408"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "board_id", "comment_id", "checked", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 1], ["board_id", 1], ["comment_id", 1], ["checked", 1], ["created_at", "2022-03-18 08:20:40.979073"], ["updated_at", "2022-03-18 08:20:40.979073"]]
---
  def create
    @comment = Comment.new(comment_params)
    @board = @comment.board
    if @comment.save
      @board.create_notification_comment!(current_user, @comment.id)