app/controllers/notifications_controller.rb

UPDATE "notifications" SET "checked" = ?, "updated_at" = ? WHERE "notifications"."id" = ?  [["checked", 1], ["updated_at", "2022-03-19 11:35:03.086645"], ["id", 4]]
---
  def index
    @notifications = current_user.passive_notifications
    @notifications.where(checked: false).each do |notification|
      notification.update_attributes(checked: true)