app/controllers/quests_controller.rb

  def show
    @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def clear
    quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]