app/controllers/quests_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @quest = Quest.new(quest_params)
    @quests = Quest.find_by(user_id: current_user,is_clear: false)
    if
    #   @quests.present?
    #   redirect_to my_page_path
    # elsif
      @quest.save

      # 必須のタスクを保存
      task_0 = Task.where(id: [1,4,6,7,8,9,10,11,12,18,21,22,23,24,25,26,27,28,29,30,31,39,40])
        task_0.each do |task|
          quest_task = QuestTask.new
            quest_task.quest_id  = @quest.id
            quest_task.task_id = task.id
            quest_task.start_time = @quest.due_day
          quest_task.save
        end

        if params[:quest][:question_4] == "1"      # 質問４で「賃貸」を選んだ場合に保存
          task_4 = Task.where(id: [2,15,16,17])

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @quest = Quest.find(params[:id])