app/controllers/quest_tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @quest_task = QuestTask.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "quest_tasks" SET "is_clear" = ?, "updated_at" = ? WHERE "quest_tasks"."id" = ?  [["is_clear", 1], ["updated_at", "2022-03-18 08:16:46.369809"], ["id", 6]]
---
  def update
     @quest_task = QuestTask.find(params[:id])
     @quest = @quest_task.quest_id
     @quest_task.update(quest_task_params)