app/controllers/quests_controller.rb

SELECT  "quests".* FROM "quests" WHERE "quests"."user_id" = ? AND "quests"."is_clear" = ? LIMIT ?  [["user_id", 1], ["is_clear", 0], ["LIMIT", 1]]
INSERT INTO "quests" ("user_id", "due_day", "created_at", "updated_at", "start_pref", "start_city", "goal_pref", "goal_city") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 1], ["created_at", "2022-03-11 09:36:41.916643"], ["updated_at", "2022-03-11 09:36:41.916643"], ["start_time", "2022-03-11 09:36:41.880547"]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 1], ["created_at", "2022-03-21 04:51:54.189739"], ["updated_at", "2022-03-21 04:51:54.189739"], ["start_time", "2022-03-21 04:51:54.161375"]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 2], ["created_at", "2022-03-21 04:51:54.199669"], ["updated_at", "2022-03-21 04:51:54.199669"], ["start_time", "2022-03-02 15:00:00"]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 3], ["created_at", "2022-03-21 04:51:54.209330"], ["updated_at", "2022-03-21 04:51:54.209330"], ["start_time", "2022-03-18 15:00:00"]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 4], ["created_at", "2022-03-21 04:51:54.220569"], ["updated_at", "2022-03-21 04:51:54.220569"], ["start_time", "2022-04-01 15:00:00"]]
---
  def create
    @quest = Quest.new(quest_params)
    @quests = Quest.find_by(user_id: current_user, is_clear: false)
    if @quests.present?
      flash[:notice] = '現在進行中のクエストがあるため保存できませんでした。'
      redirect_to my_page_path
    elsif @quest.save

      # カレンダー表示用タスクを保存
      quest_task = QuestTask.new
      quest_task.task_id = 1
      quest_task.quest_id = @quest.id
      quest_task.start_time = @quest.created_at # クエスト開始日
      quest_task.save
      quest_task = QuestTask.new
      quest_task.task_id = 2
      quest_task.quest_id = @quest.id
      quest_task.start_time = @quest.due_day.ago(30.days)  # 引越し３０日前
      quest_task.save
      quest_task = QuestTask.new
      quest_task.task_id = 3
      quest_task.quest_id = @quest.id
      quest_task.start_time = @quest.due_day.ago(14.days)  # 引越し１４日前
      quest_task.save
      quest_task = QuestTask.new
      quest_task.task_id = 4
      quest_task.quest_id = @quest.id
      quest_task.start_time = @quest.due_day # 引越し当日
      quest_task.save

INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["quest_id", 1], ["task_id", 5], ["created_at", "2022-03-21 04:51:54.228690"], ["updated_at", "2022-03-21 04:51:54.228690"], ["start_time", "2022-04-15 15:00:00"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 6], ["id", 9], ["id", 11], ["id", 21], ["id", 24], ["id", 27], ["id", 28], ["id", 29], ["id", 31], ["id", 32], ["id", 33], ["id", 34], ["id", 35], ["id", 36], ["id", 44], ["id", 45]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 6], ["created_at", "2022-03-21 06:27:42.117353"], ["updated_at", "2022-03-21 06:27:42.117353"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 6], ["created_at", "2022-03-11 09:36:41.975278"], ["updated_at", "2022-03-11 09:36:41.975278"]]
---
      quest_task.task_id = 5
      quest_task.quest_id = @quest.id
      quest_task.start_time = @quest.due_day.since(14.days) # 引越し１４日後
      quest_task.save

      # 必須のタスクを保存
      if  @quest.start_pref == @quest.goal_pref and @quest.start_city == @quest.goal_city
        task_0 = Task.where(id: [6,9,11,21,24,27,28,29,31,32,33,34,35,36,44,45])  # 同市区町村の場合
          task_0.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save
          end
      else
        task_0 = Task.where(id: [6,9,11,13,14,15,21,24,27,28,30,31,32,33,34,35,36,44,45])  # 異なる市区町村の場合
          task_0.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 7], ["id", 16], ["id", 17], ["id", 18], ["id", 25], ["id", 26]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 7], ["created_at", "2022-03-11 09:36:42.187323"], ["updated_at", "2022-03-11 09:36:42.187323"]]
---
      end

        if params[:quest][:question_4] == "1"      # 質問４で「賃貸」を選んだ場合に保存
          task_4 = Task.where(id: [7,16,17,18,25,26])
          task_4.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  [["id", 37]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 37], ["created_at", "2022-03-11 09:36:42.269744"], ["updated_at", "2022-03-11 09:36:42.269744"]]
---
        end

        if params[:quest][:question_5] == "1"    # 質問５で「持ってる」を選んだ場合に保存
          task_5 = Task.where(id: [37])
          task_5.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?, ?, ?)  [["id", 8], ["id", 38], ["id", 39], ["id", 40]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 8], ["created_at", "2022-03-11 09:36:42.285654"], ["updated_at", "2022-03-11 09:36:42.285654"]]
---
        end

        if params[:quest][:question_6] == "1"    # 質問６で「持ってる」を選んだ場合に保存
          task_6 = Task.where(id: [8,38,39,40])
          task_6.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?)  [["id", 20], ["id", 41]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 20], ["created_at", "2022-03-11 09:36:42.330746"], ["updated_at", "2022-03-11 09:36:42.330746"]]
---
        end

        if params[:quest][:question_7] == "1"    # 質問７で「持ってる」を選んだ場合に保存
          task_7 = Task.where(id: [20,41])
          task_7.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (?, ?, ?, ?)  [["id", 10], ["id", 19], ["id", 42], ["id", 43]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 10], ["created_at", "2022-03-11 09:36:42.353289"], ["updated_at", "2022-03-11 09:36:42.353289"]]
---
        end

        if params[:quest][:question_8] == "1"    # 質問８で「一緒」を選んだ場合に保存
          task_8 = Task.where(id: [10,19,42,43])
          task_8.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  [["id", 12]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 12], ["created_at", "2022-03-11 09:36:42.392404"], ["updated_at", "2022-03-11 09:36:42.392404"]]
---
        end

        if params[:quest][:question_9] == "1"    # 質問９で「してる」を選んだ場合に保存
          task_9 = Task.where(id: [12])
          task_9.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  [["id", 22]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 22], ["created_at", "2022-03-11 09:36:42.403345"], ["updated_at", "2022-03-11 09:36:42.403345"]]
---
        end

        if params[:quest][:question_10] == "1"    # 質問１０で「ある」を選んだ場合に保存
          task_10 = Task.where(id: [22])
          task_10.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  [["id", 23]]
INSERT INTO "quest_tasks" ("quest_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quest_id", 1], ["task_id", 23], ["created_at", "2022-03-11 09:36:42.413737"], ["updated_at", "2022-03-11 09:36:42.413737"]]
---
        end

        if params[:quest][:question_11] == "1"    # 質問11で「とってる」を選んだ場合に保存
          task_11 = Task.where(id: [23])
          task_11.each do |task|
            quest_task = QuestTask.new
              quest_task.quest_id  = @quest.id
              quest_task.task_id = task.id
            quest_task.save

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."quest_id" = ? AND "quest_tasks"."task_id" BETWEEN ? AND ? ORDER BY "quest_tasks"."task_id" ASC  [["quest_id", 1], ["task_id", 6], ["task_id", 10]]
SELECT "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."quest_id" = ?  [["quest_id", 1]]
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @quest = Quest.find(params[:id])
    @quest_task = QuestTask.where(quest_id: @quest.id).where('task_id > ?', 5)     # すべての実行タスク
    @quest_tasks = QuestTask.where(quest_id: @quest.id).where('task_id < ?', 6)    # カレンダー表示用

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    quest = Quest.find(params[:id])

SELECT "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."quest_id" = ?  [["quest_id", 1]]
---
  def complete
    @quest = Quest.find(params[:id])
    @quest_task = QuestTask.where(quest_id: @quest.id).where('task_id > ?', 5)     # すべての実行タスク
    @quest_tasks = QuestTask.where(quest_id: @quest.id).where('task_id < ?', 6)    # カレンダー表示用

SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "quests" WHERE "quests"."id" = ?  [["id", 1]]
---
  def destroy
    quest = Quest.find(params[:id])
    quest.destroy