app/controllers/users_controller.rb

  def mypage
    @quest = Quest.find_by(is_clear: false, user_id: current_user)
    @quests = Quest.where(is_clear: true).where(user_id: current_user)
    @boards = Board.where(user_id: current_user).page(params[:page]).per(5)
    @quest_tasks = QuestTask.where(quest_id: @quest).where('task_id < ?', 5)
---
SELECT  "quests".* FROM "quests" WHERE "quests"."is_clear" = ? AND "quests"."user_id" = ? LIMIT ?  [["is_clear", 0], ["user_id", 1], ["LIMIT", 1]]
SELECT  "boards".* FROM "boards" WHERE "boards"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "quest_tasks".* FROM "quest_tasks" WHERE "quest_tasks"."quest_id" = ?  [["quest_id", 1]]

  def update
    current_user.update(user_params)
---
UPDATE "users" SET "name" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "太郎くん"], ["image_id", nil], ["updated_at", "2022-03-21 04:29:36.968753"], ["id", 1]]

  def destroy
    current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]