app/models/board.rb

SELECT DISTINCT "comments"."user_id" FROM "comments" WHERE "comments"."board_id" = ? AND "comments"."user_id" != ?  [["board_id", 1], ["user_id", 1]]
---
  def create_notification_comment!(current_user, comment_id)
    temp_ids = Comment.select(:user_id).where(board_id: id).where.not(user_id: current_user.id).distinct
    temp_ids.each do |temp_id|

INSERT INTO "notifications" ("visitor_id", "visited_id", "board_id", "comment_id", "checked", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 1], ["board_id", 1], ["comment_id", 1], ["checked", 1], ["created_at", "2022-03-18 08:20:40.979073"], ["updated_at", "2022-03-18 08:20:40.979073"]]
---
  def save_notification_comment!(current_user, comment_id, visited_id)
    notification = current_user.active_notifications.new(
      board_id: id,
      comment_id: comment_id,
      visited_id: visited_id
    )
    notification.checked = true if notification.visitor_id == notification.visited_id
    notification.save if notification.valid?